results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-256/ycsbwklda/CIPI_PERF.out
Setting g_min_fd 4 
Setting g_min_fd 4 
RocksDB:    version 5.4
Date:       Sun Mar  3 20:39:33 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklda    :      40.234 micros/op 24854 ops/sec; ( reads:317732 writes:316267 total:50000000 found:317732)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklda --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 189.58
	System time (seconds): 206.26
	Percent of CPU this job got: 188%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:29.77
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 2000716
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 65
	Minor (reclaiming a frame) page faults: 4237592
	Voluntary context switches: 20199363
	Involuntary context switches: 3256
	Swaps: 0
	File system inputs: 60402488
	File system outputs: 196145872
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[80503.587702] sh (239355): drop_caches: 3
[80503.648168] sh (239366): drop_caches: 3
[80537.833990] write_proc_unbounded: Value of write = 1
[80537.833999] write_proc_2mb_limit: Value of write = 1
[80537.834004] write_proc_bitmap_shift: Value of write = 38
[80537.839015] write_proc_unbounded: Value of write = 1
[80537.839025] write_proc_2mb_limit: Value of write = 1
[80537.839030] write_proc_bitmap_shift: Value of write = 38
[80747.495216] write_proc_unbounded: Value of write = 0
[80747.495234] write_proc_2mb_limit: Value of write = 0
[80747.610464] write_proc_unbounded: Value of write = 0
[80747.610472] write_proc_2mb_limit: Value of write = 0